Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/goormdotcom/prod/runs/run-t9tqo23g48yTrxk9

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
module.rds_order.aws_db_parameter_group.this: Refreshing state... [id=order-pg-16]
module.rds_product.aws_db_parameter_group.this: Refreshing state... [id=product-pg-16]
module.common_network.aws_vpc.goorm: Refreshing state... [id=vpc-05849d37708e8d04b]
module.rds_user.aws_db_parameter_group.this: Refreshing state... [id=user-pg-16]
module.rds_payment.aws_db_parameter_group.this: Refreshing state... [id=payment-pg-16]
module.common_network.aws_subnet.private-app: Refreshing state... [id=subnet-039f40894ea2007f2]
module.common_network.aws_subnet.public: Refreshing state... [id=subnet-09ad4d9343cfb64c7]
module.common_network.aws_subnet.private-db: Refreshing state... [id=subnet-05a8605bf45055418]
module.common_network.aws_subnet.private-db-2: Refreshing state... [id=subnet-0510549f3411c9d6b]
module.security.aws_security_group.rds_order: Refreshing state... [id=sg-01500a61cef193bc6]
module.security.aws_security_group.rds_user: Refreshing state... [id=sg-0c32e1ec713957804]
module.security.aws_security_group.rds_payment: Refreshing state... [id=sg-0613fe7cffbbed089]
module.security.aws_security_group.rds_product: Refreshing state... [id=sg-0f9265b7ebd7016e2]
module.rds_payment.aws_db_subnet_group.this: Refreshing state... [id=payment-db-subnet-group]
module.rds_user.aws_db_subnet_group.this: Refreshing state... [id=user-db-subnet-group]
module.rds_product.aws_db_subnet_group.this: Refreshing state... [id=product-db-subnet-group]
module.rds_order.aws_db_subnet_group.this: Refreshing state... [id=order-db-subnet-group]
module.rds_payment.aws_db_instance.this: Refreshing state... [id=payment]
module.rds_order.aws_db_instance.this: Refreshing state... [id=order]
module.rds_user.aws_db_instance.this: Refreshing state... [id=user]
module.rds_product.aws_db_instance.this: Refreshing state... [id=product]
module.rds_order.aws_db_instance.this: Drift detected (update)
module.rds_payment.aws_db_instance.this: Drift detected (update)
module.rds_product.aws_db_instance.this: Drift detected (update)
module.rds_user.aws_db_instance.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecr_order.data.aws_iam_policy_document.pull will be read during apply
 <= data "aws_iam_policy_document" "pull" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "GetAuthorizationToken"
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:ListImages",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "PullFromRepository"
        }
    }

  # module.ecr_order.data.aws_iam_policy_document.push will be read during apply
 <= data "aws_iam_policy_document" "push" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "GetAuthorizationToken"
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:CompleteLayerUpload",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:InitiateLayerUpload",
              + "ecr:ListImages",
              + "ecr:PutImage",
              + "ecr:UploadLayerPart",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "PushToRepository"
        }
    }

  # module.ecr_order.aws_ecr_lifecycle_policy.this will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Retain only last 2 images (tagged or untagged)"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 2
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "goormdotcom/order-service"
    }

  # module.ecr_order.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "goormdotcom/order-service"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all             = {
          + "ManagedBy" = "Terraform"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_order.aws_iam_policy.pull will be created
  + resource "aws_iam_policy" "pull" {
      + arn         = (known after apply)
      + description = "Allow pulling images"
      + id          = (known after apply)
      + name        = "ecr-pull"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all    = {
          + "ManagedBy" = "Terraform"
        }
    }

  # module.ecr_order.aws_iam_policy.push will be created
  + resource "aws_iam_policy" "push" {
      + arn         = (known after apply)
      + description = "Allow pushing images"
      + id          = (known after apply)
      + name        = "ecr-push"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all    = {
          + "ManagedBy" = "Terraform"
        }
    }

  # module.ecr_payment.data.aws_iam_policy_document.pull will be read during apply
 <= data "aws_iam_policy_document" "pull" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "GetAuthorizationToken"
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:ListImages",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "PullFromRepository"
        }
    }

  # module.ecr_payment.data.aws_iam_policy_document.push will be read during apply
 <= data "aws_iam_policy_document" "push" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "GetAuthorizationToken"
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:CompleteLayerUpload",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:InitiateLayerUpload",
              + "ecr:ListImages",
              + "ecr:PutImage",
              + "ecr:UploadLayerPart",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "PushToRepository"
        }
    }

  # module.ecr_payment.aws_ecr_lifecycle_policy.this will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Retain only last 2 images (tagged or untagged)"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 2
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "goormdotcom/payment-service"
    }

  # module.ecr_payment.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "goormdotcom/payment-service"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all             = {
          + "ManagedBy" = "Terraform"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_payment.aws_iam_policy.pull will be created
  + resource "aws_iam_policy" "pull" {
      + arn         = (known after apply)
      + description = "Allow pulling images"
      + id          = (known after apply)
      + name        = "ecr-pull"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all    = {
          + "ManagedBy" = "Terraform"
        }
    }

  # module.ecr_payment.aws_iam_policy.push will be created
  + resource "aws_iam_policy" "push" {
      + arn         = (known after apply)
      + description = "Allow pushing images"
      + id          = (known after apply)
      + name        = "ecr-push"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all    = {
          + "ManagedBy" = "Terraform"
        }
    }

  # module.ecr_product.data.aws_iam_policy_document.pull will be read during apply
 <= data "aws_iam_policy_document" "pull" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "GetAuthorizationToken"
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:ListImages",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "PullFromRepository"
        }
    }

  # module.ecr_product.data.aws_iam_policy_document.push will be read during apply
 <= data "aws_iam_policy_document" "push" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "GetAuthorizationToken"
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:CompleteLayerUpload",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:InitiateLayerUpload",
              + "ecr:ListImages",
              + "ecr:PutImage",
              + "ecr:UploadLayerPart",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "PushToRepository"
        }
    }

  # module.ecr_product.aws_ecr_lifecycle_policy.this will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Retain only last 2 images (tagged or untagged)"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 2
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "goormdotcom/product-service"
    }

  # module.ecr_product.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "goormdotcom/product-service"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all             = {
          + "ManagedBy" = "Terraform"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_product.aws_iam_policy.pull will be created
  + resource "aws_iam_policy" "pull" {
      + arn         = (known after apply)
      + description = "Allow pulling images"
      + id          = (known after apply)
      + name        = "ecr-pull"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all    = {
          + "ManagedBy" = "Terraform"
        }
    }

  # module.ecr_product.aws_iam_policy.push will be created
  + resource "aws_iam_policy" "push" {
      + arn         = (known after apply)
      + description = "Allow pushing images"
      + id          = (known after apply)
      + name        = "ecr-push"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all    = {
          + "ManagedBy" = "Terraform"
        }
    }

  # module.ecr_user.data.aws_iam_policy_document.pull will be read during apply
 <= data "aws_iam_policy_document" "pull" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "GetAuthorizationToken"
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:ListImages",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "PullFromRepository"
        }
    }

  # module.ecr_user.data.aws_iam_policy_document.push will be read during apply
 <= data "aws_iam_policy_document" "push" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "GetAuthorizationToken"
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:CompleteLayerUpload",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:InitiateLayerUpload",
              + "ecr:ListImages",
              + "ecr:PutImage",
              + "ecr:UploadLayerPart",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "PushToRepository"
        }
    }

  # module.ecr_user.aws_ecr_lifecycle_policy.this will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Retain only last 2 images (tagged or untagged)"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 2
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "goormdotcom/user-service"
    }

  # module.ecr_user.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "goormdotcom/user-service"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all             = {
          + "ManagedBy" = "Terraform"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_user.aws_iam_policy.pull will be created
  + resource "aws_iam_policy" "pull" {
      + arn         = (known after apply)
      + description = "Allow pulling images"
      + id          = (known after apply)
      + name        = "ecr-pull"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all    = {
          + "ManagedBy" = "Terraform"
        }
    }

  # module.ecr_user.aws_iam_policy.push will be created
  + resource "aws_iam_policy" "push" {
      + arn         = (known after apply)
      + description = "Allow pushing images"
      + id          = (known after apply)
      + name        = "ecr-push"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all    = {
          + "ManagedBy" = "Terraform"
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 4 of 8 estimated
           $301.8399999999998976/mo +$0.0

<!-- Sticky Pull Request Commentterraform-plan -->